In [1]:
import numpy as np
import pandas as pd

### Pandas Series

In [5]:
indexes = ['a', 'b', 'c']
datas = [10, 20, 30]
data_index_map = {'a': 10, 'b': 20, 'c': 30}
np_arr = np.array([10, 20, 30])

In [6]:
pd.Series(data=datas, index=indexes)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(np_arr)

0    10
1    20
2    30
dtype: int64

In [9]:
# to label data instead of the default 0, 1, 2, ...
# not implicitly passing in variables with parameters assignment as above
pd.Series(np_arr, labels)

a    10
b    20
c    30
dtype: int64

In [10]:
# to get same result by passing in a dict
pd.Series(data_index_map)

a    10
b    20
c    30
dtype: int64

In [13]:
sales_q1 = pd.Series(data=[100, 200, 300, 400], index=['Yangon', 'Mandalay', 'Taunggyi', 'Naypyitaw'])

In [14]:
sales_q1

Yangon       100
Mandalay     200
Taunggyi     300
Naypyitaw    400
dtype: int64

In [15]:
sales_q2 = pd.Series(data=[150, 250, 350, 450], index=['Yangon', 'Mandalay', 'Taunggyi', 'Hsipay'])

In [16]:
sales_q2

Yangon      150
Mandalay    250
Taunggyi    350
Hsipay      450
dtype: int64

In [17]:
# access like a dict
sales_q2['Yangon']

150

In [18]:
# access by index
sales_q2[0]

150

In [19]:
# realize that Hsipaw and Naypyitaw returns NaN, each one of them present in one series but not the other
sales_q1 + sales_q2

Hsipay         NaN
Mandalay     450.0
Naypyitaw      NaN
Taunggyi     650.0
Yangon       250.0
dtype: float64

### Pandas Dataframes

In [20]:
# multiple Pandas series that share the same index

In [21]:
from numpy.random import randint

In [26]:
# corresponds to below 5x4 array data
columns = ['w', 'x', 'y', 'z']
indexes = ['a', 'b', 'c', 'd', 'e']

In [29]:
np.random.seed(100) # seed it to get same random numbers everytime the code get executed
data = randint(-100, 100, (5, 4)) # 5x4 shape
data

array([[-92, -76, -33,   3],
       [-13, -21,  76,  38],
       [ -6,  80,  -2, -47],
       [-34, -86, -66, -76],
       [ 43,   7, -40, -42]])

In [31]:
df = pd.DataFrame(data, indexes, columns)
df

    w   x   y   z
a -92 -76 -33   3
b -13 -21  76  38
c  -6  80  -2 -47
d -34 -86 -66 -76
e  43   7 -40 -42

In [32]:
# accessing a single column
df['w']

a   -92
b   -13
c    -6
d   -34
e    43
Name: w, dtype: int64

In [33]:
# return pd series (without column name), thus verify the definition of pandas dataframe
type(df['w'])

pandas.core.series.Series

In [34]:
# to access multiple columns, pass in a list. In this case, the returned type is Pandas DF
df[['w', 'z']]

    w   z
a -92   3
b -13  38
c  -6 -47
d -34 -76
e  43 -42

In [35]:
type(df[['w', 'z']])

pandas.core.frame.DataFrame

In [36]:
# creating a new column based off of existing columns - usually used in Feature Engineering
df['FE_Col1'] = df['w'] + df['z']

In [37]:
df

    w   x   y   z  FE_Col1
a -92 -76 -33   3      -89
b -13 -21  76  38       25
c  -6  80  -2 -47      -53
d -34 -86 -66 -76     -110
e  43   7 -40 -42        1

In [38]:
# by default axis=0 meaning it will look for index not column
# dropping is usually used in feature engineering column that is noisy/not improving performance
# THIS IS NOT IN PLACE DROPPING
df.drop('FE_Col1', axis=1)

    w   x   y   z
a -92 -76 -33   3
b -13 -21  76  38
c  -6  80  -2 -47
d -34 -86 -66 -76
e  43   7 -40 -42

In [39]:
df

    w   x   y   z  FE_Col1
a -92 -76 -33   3      -89
b -13 -21  76  38       25
c  -6  80  -2 -47      -53
d -34 -86 -66 -76     -110
e  43   7 -40 -42        1

In [ ]:
df = df.drop('FE_Col1', axis=1)

In [42]:
df

    w   x   y   z
a -92 -76 -33   3
b -13 -21  76  38
c  -6  80  -2 -47
d -34 -86 -66 -76
e  43   7 -40 -42

In [45]:
# same operations for row
df.loc['a'] # loc meaning look in index/row, returned Pandas Series

w   -92
x   -76
y   -33
z     3
Name: a, dtype: int64

In [46]:
df.loc[['a', 'e']]

    w   x   y   z
a -92 -76 -33   3
e  43   7 -40 -42

In [47]:
df.iloc[0] # accessing based on index, first row

w   -92
x   -76
y   -33
z     3
Name: a, dtype: int64

In [48]:
df.iloc[-1] # access last row

w    43
x     7
y   -40
z   -42
Name: e, dtype: int64

In [49]:
df.iloc[0:3]

    w   x   y   z
a -92 -76 -33   3
b -13 -21  76  38
c  -6  80  -2 -47

In [50]:
df.drop('c') # in this case, no need to specify axis since by defaults axis=0

    w   x   y   z
a -92 -76 -33   3
b -13 -21  76  38
d -34 -86 -66 -76
e  43   7 -40 -42

In [51]:
# selecting both rows and columns
df

    w   x   y   z
a -92 -76 -33   3
b -13 -21  76  38
c  -6  80  -2 -47
d -34 -86 -66 -76
e  43   7 -40 -42

In [52]:
df.loc['d', 'w'] # row d, column w

-34

In [53]:
df.loc[['a', 'e'], ['x', 'y']] # row a,e. column x y

    x   y
a -76 -33
e   7 -40

### Conditional Selecting

In [54]:
df > 0

       w      x      y      z
a  False  False  False   True
b  False  False   True   True
c  False   True  False  False
d  False  False  False  False
e   True   True  False  False

In [58]:
df[df > 0] # returns NaN for falsy cell

      w     x     y     z
a   NaN   NaN   NaN   3.0
b   NaN   NaN  76.0  38.0
c   NaN  80.0   NaN   NaN
d   NaN   NaN   NaN   NaN
e  43.0   7.0   NaN   NaN

In [56]:
df['x'] > 0

a    False
b    False
c     True
d    False
e     True
Name: x, dtype: bool

In [57]:
df[df['x'] > 0] # broadcast the conditin entire dataframe -> returns truty rows that is row c and d

    w   x   y   z
c  -6  80  -2 -47
e  43   7 -40 -42

In [59]:
df[df['x'] > 0]['w'] # normal df operation, stack operations on top of each other in one line

c    -6
e    43
Name: w, dtype: int64

In [61]:
# multiple condtional statemenets
# 1. write out all condition individually. df['w'] > 0  df['y'] > 1
# 2. bracket individual condition. (df['w'] > 0)  (df['y'] > 1)
# 3. write the logic operator. &, | for example. (df['w'] > 0) & (df['y'] > 1)
# 4. broadcast it through a list to df. df[(df['w'] > 0) & (df['y'] > 1)]
df[(df['w'] > 0) & (df['y'] > 1)]

Empty DataFrame
Columns: [w, x, y, z]
Index: []

In [62]:
df[(df['w'] > 0) | (df['y'] > 1)]

    w   x   y   z
b -13 -21  76  38
e  43   7 -40 -42

In [63]:
# Resetting index
df

    w   x   y   z
a -92 -76 -33   3
b -13 -21  76  38
c  -6  80  -2 -47
d -34 -86 -66 -76
e  43   7 -40 -42

In [64]:
df.reset_index() # create a new column called index for the old indexes, and integer values as the new indexes

  index   w   x   y   z
0     a -92 -76 -33   3
1     b -13 -21  76  38
2     c  -6  80  -2 -47
3     d -34 -86 -66 -76
4     e  43   7 -40 -42

In [65]:
state_indexes = ['VANCOUVER', 'MONTREAL', 'WATERLOO', 'TORONTO', 'OTTAWA']

In [66]:
df['city'] = state_indexes # creating a new column from a list

In [67]:
df

    w   x   y   z       city
a -92 -76 -33   3  VANCOUVER
b -13 -21  76  38   MONTREAL
c  -6  80  -2 -47   WATERLOO
d -34 -86 -66 -76    TORONTO
e  43   7 -40 -42     OTTAWA

In [69]:
# set the new column as the index. city is the name of the index, not the column name
# can differentiated by locating below the column name not align
df.set_index('city')

            w   x   y   z
city
VANCOUVER -92 -76 -33   3
MONTREAL  -13 -21  76  38
WATERLOO   -6  80  -2 -47
TORONTO   -34 -86 -66 -76
OTTAWA     43   7 -40 -42

In [70]:
df

    w   x   y   z       city
a -92 -76 -33   3  VANCOUVER
b -13 -21  76  38   MONTREAL
c  -6  80  -2 -47   WATERLOO
d -34 -86 -66 -76    TORONTO
e  43   7 -40 -42     OTTAWA

In [71]:
df.describe()

               w          x          y          z
count   5.000000   5.000000   5.000000   5.000000
mean  -20.400000 -19.200000 -13.000000 -24.800000
std    48.972441  67.488518  54.726593  45.074383
min   -92.000000 -86.000000 -66.000000 -76.000000
25%   -34.000000 -76.000000 -40.000000 -47.000000
50%   -13.000000 -21.000000 -33.000000 -42.000000
75%    -6.000000   7.000000  -2.000000   3.000000
max    43.000000  80.000000  76.000000  38.000000

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 5 columns):
w       5 non-null int64
x       5 non-null int64
y       5 non-null int64
z       5 non-null int64
city    5 non-null object
dtypes: int64(4), object(1)
memory usage: 400.0+ bytes

In [73]:
df.dtypes

w        int64
x        int64
y        int64
z        int64
city    object
dtype: object

### How To Work With Missing Data

# Three ways

1). Leave it as missing

2). Remove it

3). Fill in missing data

In [74]:
missing_data_df = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [4, np.nan, np.nan, 8],
    'C': [10, 20, 30, 40]
})

In [75]:
missing_data_df

     A    B   C
0  1.0  4.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [77]:
missing_data_df.dropna() # by default, axis=0. Thus, dropping all row that has at least one NaN

     A    B   C
0  1.0  4.0  10
3  4.0  8.0  40

In [79]:
missing_data_df.dropna(axis=1) # drop columns that has at least 1 NaN

    C
0  10
1  20
2  30
3  40

In [80]:
missing_data_df.dropna(axis=1, thresh=2) # return threshold column that has at MOST 2 NaN

     A    B   C
0  1.0  4.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [81]:
missing_data_df.dropna(axis=1, thresh=3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

In [82]:
missing_data_df

     A    B   C
0  1.0  4.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [83]:
# pandas doesn't complain eventhough "fill value" is a different type
# it converted existing type to match String
missing_data_df.fillna(value="fill value")

            A           B   C
0           1           4  10
1           2  fill value  20
2  fill value  fill value  30
3           4           8  40

In [84]:
missing_data_df.fillna(value=0)

     A    B   C
0  1.0  4.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [86]:
# only filled specific column
missing_data_df['A'].fillna(value=0)

0    1.0
1    2.0
2    0.0
3    4.0
Name: A, dtype: float64

In [87]:
missing_data_df['A'] =  missing_data_df['A'].fillna(value=0)
missing_data_df

     A    B   C
0  1.0  4.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40